<?php

return [
    'welcome' => 'ברוך הבא',
    'register' => 'הירשם',
    'login' => 'היכנס',
    'logout' => 'התנתק',
    'profile' => 'פרופיל',

    'id' => 'מזהה',
    'slug' => 'Slug',
    'name' => 'שם',
    'email' => 'אימייל',
    'description' => 'תיאור',
    'created_at' => 'נוצר בתאריך',
    'updated_at' => 'עודכן בתאריך',
    'actions' => 'פעולות',
    'edit' => 'לערוך',
    'save' => 'לשמור',
    'saved' => 'נשמר.',
    'delete' => 'למחוק',
    'cancel' => 'לבטל',
    'total' => 'סה"כ',

    'stores' => [
        'current' => 'חנות נוכחית',
        'title' => 'חנויות',
        'categories' => 'קטגוריות',
    ],

    'dashboard' => [
        'title' => 'לוח בקרה',
        'logged_in' => 'אתה מחובר!',
    ],

    'categories' => [
        'title' => 'קטגוריות',
        'empty' => 'טרם נוצרו קטגוריות.',
        'create' => 'צור קטגוריה',
        'edit' => 'עריכת הקטגוריה #:id',
        'delete' => 'למחוק את הקטגוריה',
        'delete_confirm' => [
            'text' => 'האם אתה בטוח שברצונך למחוק את הקטגוריה #:id?',
        ],
    ],

    'products' => [
        'title' => 'מוצרים',
        'empty' => 'טרם נוצרו מוצרים.',
        'create' => 'צור מוצר',
        'edit' => 'עריכת המוצר #:id',
        'price' => 'מחיר',
        'delete' => 'למחוק את המוצר',
        'delete_confirm' => [
            'text' => 'האם אתה בטוח שברצונך למחוק את המוצר #:id?',
        ],
    ],

    'users' => [
        'title' => 'משתמשים',
        'create' => 'צור משתמש',
        'edit' => 'עריכת המשתמש #:id',
        'roles' => 'תפקידים',
        'created_at' => 'נרשם בתאריך',
        'switch' => 'לעבור',
        'delete' => 'למחוק את המשתמש',
        'delete_confirm' => [
            'text' => 'האם אתה בטוח שברצונך למחוק את המשתמש #:id?',
            'description' => 'פעם שהחשבון יימחק, כל המשאבים והנתונים שלו יימחקו לצמיתות.',
        ],
        'profile' => [
            'title' => 'פרטי פרופיל',
            'description' => 'עדכן את פרטי הפרופיל וכתובת האימייל.',
        ],
        'password' => [
            'title' => 'עדכון סיסמה',
            'description' => 'ודא שהחשבון משתמש בסיסמה ארוכה ואקראית כדי לשמור על הבטיחות.',
            'new' => 'סיסמה חדשה',
            'confirm' => 'אישור סיסמה',
        ],
    ],

    'cart' => [
        'title' => 'עגלה',
        'add' => 'הוסף לעגלה',
        'open' => 'עבור לעגלה',
        'total' => 'סה"כ',
        'empty' => 'העגלה שלך ריקה.',
        'remove' => 'להסיר',
        'close' => 'המשך לקניות',
        'checkout' => 'התקדם לנקודת הביקורת',
    ],

    'checkout' => [
        'title' => 'תשלום',
        'details' => [
            'title' => 'פרטי ההזמנה',
            'name' => 'שם',
            'email' => 'אימייל',
            'phone' => 'טלפון',
            'address' => 'כתובת',
            'comment' => 'הערה',
        ],
        'pay' => [
            'title' => 'שלם',
            'card' => 'שלם באמצעות כרטיס אשראי',
        ],
    ],
];
